cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFA3xM.xml
        <!-- REGISTER "LCDRAM28" -->
        <register>
          <name>LCDRAM28</name>
          <description>Display Data Memory Register 28</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 28</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM29" -->
        <register>
          <name>LCDRAM29</name>
          <description>Display Data Memory Register 29</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 29</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM30" -->
        <register>
          <name>LCDRAM30</name>
          <description>Display Data Memory Register 30</description>
          <addressOffset>0x3A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 30</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM31" -->
        <register>
          <name>LCDRAM31</name>
          <description>Display Data Memory Register 31</description>
          <addressOffset>0x3B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 31</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM32" -->
        <register>
          <name>LCDRAM32</name>
          <description>Display Data Memory Register 32</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 32</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM33" -->
        <register>
          <name>LCDRAM33</name>
          <description>Display Data Memory Register 33</description>
          <addressOffset>0x3D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 33</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM34" -->
        <register>
          <name>LCDRAM34</name>
          <description>Display Data Memory Register 34</description>
          <addressOffset>0x3E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 34</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM35" -->
        <register>
          <name>LCDRAM35</name>
          <description>Display Data Memory Register 35</description>
          <addressOffset>0x3F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 35</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM36" -->
        <register>
          <name>LCDRAM36</name>
          <description>Display Data Memory Register 36</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 36</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM37" -->
        <register>
          <name>LCDRAM37</name>
          <description>Display Data Memory Register 37</description>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 37</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
